w8/W8D1/reddit-clone/app/controllers/application_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def is_moderator?
        sub = Sub.find_by(id: params[:id])