w8/W8D1/reddit-clone/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "session_token", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "m-DHc5pnOSrq3n945L7hpg"], ["updated_at", "2020-11-09 19:48:33.637780"], ["id", 3]]
---
    def create
        @user = User.create(user_params)
        if @user.save