w7/W7D2/music-app/app/controllers/application_controller.rb

    def current_user
        #! where is session token being set?
        @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "lsMIB_WkQmPyuYo6hGg-jg"], ["LIMIT", 1]]