w6/W6D4/art-share-api/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "a random"], ["email", "arandom@email.com"]]
---
    def create

        user = User.new(user_params)
        #strong params / not blind mass assignment
        # replace the `user_attributes_here` with the actual attribute keys
        if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2 WHERE "users"."id" = $3  [["name", "Leo"], ["email", "cutetie@qq.com"], ["id", 2]]
---
    def update
        user = User.find_by(id: params[:id])
        user.update(user_params)